app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
---
  def card
    @user = User.find(params[:id])

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "users" ("name", "about", "password_digest", "email", "linkedin", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @new_user = User.new(user_params)
    @category = Category.find(params[:user][:categories].to_i)
    if @new_user.save